42crunch.vscode-openapi
andyyaldoo.vscode-json
antfu.goto-alias
anthropic.claude-code
ask-toolkit.alexa-skills-kit-toolkit
atlassian.atlascode
bradlc.vscode-tailwindcss
circleci.circleci
ckolkman.vscode-postgres
continue.continue
dart-code.dart-code
dbaeumer.vscode-eslint
dendron.dendron
dendron.dendron-paste-image
devine-davies.make-hidden
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
dheovani.svg-viewer
esbenp.prettier-vscode
fabianlauer.vs-code-xml-format
foxundermoon.shell-format
francescoanzalone.smart-xml-diff
freecodecamp.freecodecamp-dark-vscode-theme
fruuties.todo-sidebar
gamemodeone.json-compact-prettier
george-alisson.html-preview-vscode
github.copilot
github.copilot-chat
google.gemini-cli-vscode-ide-companion
google.geminicodeassist
gruntfuggly.todo-tree
hashicorp.terraform
hediet.vscode-drawio
humao.rest-client
humy2833.ftp-simple
inferrinizzard.prettier-sql-vscode
ioggstream.markdown-mermaid-d3fend
jannisx11.batch-rename-extension
johnpapa.vscode-peacock
kelvin.vscode-sshfs
kevinrose.vsc-python-indent
lewissteele.vscode-sql-lint
liximomo.remotefs
lkytal.flatui
mark-tucker.aws-cli-configure
mathematic.vscode-pdf
mechatroner.rainbow-csv
mongodb.mongodb-vscode
ms-azure-load-testing.microsoft-testing
ms-azuretools.azure-dev
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-cosmosdb
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-account
ms-vscode.azure-repos
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.vscode-node-azure-pack
ms-vscode.vscode-typescript-next
ms-vscode.wasm-dwarf-debugging
ms-vsliveshare.vsliveshare
ms-windows-ai-studio.windows-ai-studio
natizyskunk.sftp
nuxt.mdc
nuxtr.nuxt-vscode-extentions
nuxtr.nuxtr-vscode
oderwat.indent-rainbow
oussma-hamdaoui.simple-ftp
pascalreitermann93.vscode-yaml-sort
pleiades.java-extension-pack-jdk
pmneo.tsimporter
pomber.git-file-history
psaren.vue3-composition-snippets
quicktype.quicktype
qwtel.sqlite-viewer
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
rifi2k.format-html-in-php
ritwickdey.liveserver
rvest.vs-code-prettier-eslint
shardulm94.trailing-spaces
softwaredotcom.swdc-vscode
streetsidesoftware.code-spell-checker
teamsdevapp.vscode-ai-foundry
tht13.html-preview-vscode
tikou-web.gcp-switch-config
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vstirbu.vscode-mermaid-preview
vue.volar
wakatime.vscode-wakatime
wscats.vue
xdebug.php-debug
